---
kind: method
id: M:Autodesk.Revit.DB.Electrical.InsulationTypeSet.Erase(Autodesk.Revit.DB.Electrical.InsulationType)
source: html/f17b93ae-1c73-faf2-46e8-640b037c5999.htm
---
# Autodesk.Revit.DB.Electrical.InsulationTypeSet.Erase Method

Removes a specified insulation type from the set.

## Syntax (C#)
```csharp
public virtual int Erase(
	InsulationType item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Electrical.InsulationType`) - The insulation type to be erased.

## Returns
The number of insulation types that were erased from the set.